tap "homebrew/fuse"
tap "homebrew/science"
tap "caskroom/cask"
tap "caskroom/versions"
tap "caskroom/drivers"

cask_args appdir: "/Applications"

brew "ack"
brew "aria2"
brew "arp-scan"
brew "libnet"
brew "arping"
brew "chruby"
brew "ctags"
brew "direnv"
brew "editorconfig"
brew "erlang"
brew "elixir"
brew "elm"
brew "git"
brew "elm-format"
brew "fzf"
brew "gnupg2"
brew "go"
brew "graphviz"
brew "htop-osx"
brew "iftop"
brew "imagemagick"
brew "kubernetes-cli"
brew "leiningen"
brew "lua"
brew "macvim"
brew "mas"
brew "md5deep"
brew "minicom"
brew "mtr"
brew "ncurses"
brew "p7zip"
brew "pstree"
brew "pv"
brew "reattach-to-user-namespace"
brew "rlwrap"
brew "ruby-install"
brew "s3cmd"
brew "tcpflow"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tmate"
brew "tmux"
brew "tree"
brew "vim", args: ["with-override-system-vi"]
brew "watch"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "unison"
brew "dos2unix"
brew "heroku"
brew "syncthing", restart_service: :changed
brew "syncthing-inotify", restart_service: :changed

cask "launchcontrol"
cask "anaconda"

cask "r-app"
cask "rstudio"

cask "google-chrome"
cask "dropbox"
cask "iterm2"
cask "vlc"
cask "alfred"
cask "arq"
cask "dash"
cask "crashplan"
cask "hammerspoon"
cask "kindle"
cask "plex-media-server"
cask "plex-media-player"
cask "handbrake"
cask "viber"
cask "skype"
cask "whatsapp"
cask "slack"
cask "virtualbox"
cask "torbrowser"
cask "fritzing"
cask "evernote"
cask "minecraft"
cask "sonos"
cask "telegram"
cask "docker-edge"
cask "vagrant"
cask "synergy"
cask "mailplane"
cask "1password"
cask "zerotier-one"
